// const number = Number(prompt("Enter number:"));

// if (number === 10) {
//     alert('Вірно')
// } else alert('Невірно');

// number === 10 ? alert('Вірно') : alert('Невірно');

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 15) {
//     alert(`${min} входить у першу чверть`)
// } else if (min <= 30) {
//     alert(`${min} входить у другу чверть`)
// } else if (min <= 45) {
//     alert(`${min} входить у третю чверть`)
// } else {
//     alert(`${min} входить у четверту чверть`)
// }

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = Number(prompt('Введіть число від 1 до 4:'));
// let result;
// switch (num) {
//     case 1:
//         result = 'Зима'
//     break;
//     case 2:
//         result = 'Весна'
//     break;
//     case 3:
//         result = 'Літо'
//     break;
//     case 4:
//         result = 'Осінь'
//     break;
//     default:
//         result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно'
// }

// console.log(result);

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


// const userName = prompt('Представтесь!!!!');
// console.log(userName);

// if (userName === "Адмін") {
//     const userPass = prompt('Тоді введи пароль!!!!!!!!!!!!!');
//     if (userPass === "Я головний") {
//     alert('Доброго раночку, хозяін!!!!');
// } else {
//     alert('Невірний пароль!');
// }
// } else if (userName === "" || userName === null) {
//     alert('Скасовано');
// } else {
//     alert('Я вас не знаю');
// }



// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let count = 0;
// while (count <= 20) {
//     console.log(count);
//     count += 1;
// }


// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

function getNumbers(min, max) { 
    
}